import type { Meta, StoryObj } from '@storybook/react-vite';

import { DateRangePicker } from './DateRangePicker';

/**
 * # DateRangePicker
 *
 * DateRangePicker объединяет два поля даты (DateField) и всплывающее окно (popover)
 * с календарем диапазона (RangeCalendar),
 * позволяя пользователям вводить или выбирать диапазон дат и времени.
 *
 * ## Особенности
 *
 * DateRangePicker можно создать с использованием двух отдельных элементов `<input type="date">`, но это очень ограничено по функциональности, не имеет возможностей интернационализации, несовместимо между браузерами и сложно стилизуется. DateRangePicker помогает достичь доступных и интернациональных выборщиков диапазона дат и времени, которые могут быть стилизованы по мере необходимости.
 *
 * - **Даты и время** – Поддержка дат и времени с настраиваемой гранулярностью.
 * - **Международная поддержка** – Поддержка 13 календарных систем, используемых по всему миру, включая григорианский, буддийский, исламский, персидский и другие. Доступны специфическая для локали форматировка, системы чисел, циклы часов и поддержка справа налево.
 * - **Осведомленность о часовом поясе** – Даты и время могут дополнительно включать часовой пояс. Все изменения следуют правилам часовых поясов, таким как переход на летнее/зимнее время.
 * - **Доступность** – Каждый сегмент даты и времени отображается как индивидуально фокусируемый и редактируемый элемент, что позволяет пользователям легко редактировать даты с помощью клавиатуры в любом формате даты и локали. Пользователи также могут открыть всплывающее окно с календарем для выбора диапазонов дат в стандартной сетке месяца. Локализованные сообщения для экранных читалок включены для объявления изменений в выборе и видимом диапазоне дат.
 * - **Touch friendly** – Сегменты дат можно редактировать с помощью простого в использовании числового клавиатурного ввода, диапазоны дат можно выбирать, проводя пальцем по датам в календаре с помощью сенсорного экрана, и все взаимодействия доступны для экранных читалок с сенсорным вводом.
 * - **Валидация** – Интеграция с HTML-формами, поддерживающая обязательные, минимальные и максимальные значения, недоступные даты, пользовательские функции валидации, валидацию в реальном времени и ошибки валидации на стороне сервера.
 * - **Настраиваемость** – Как и во всех компонентах React Aria, DOM-структура и стилизация всех элементов могут быть полностью настроены.
 *
 * ## Анатомия
 *
 * DateRangePicker состоит из метки и группы, содержащей два поля даты и кнопку. Нажатие на кнопку открывает всплывающее окно с календарем диапазона. Поля даты включают сегменты, представляющие каждую единицу даты и времени (например, годы, месяцы, дни и т. д.), каждый из которых можно индивидуально фокусировать и редактировать с помощью клавиатуры. Всплывающее окно с календарем предлагает более визуальный способ выбора диапазона дат.
 *
 * DateRangePicker также поддерживает необязательные элементы описания и сообщения об ошибках, которые могут использоваться для предоставления дополнительного контекста относительно поля и любых сообщений валидации. Эти элементы связаны с полем ввода через атрибут `aria-describedby`.
 *
 * ### Дополнительно об анатомии
 *
 * Если у компонента DateRangePicker нет видимой метки, атрибут `aria-label` или `aria-labelledby` должен быть передан вместо этого для идентификации его для вспомогательных технологий.
 *
 * Обратите внимание, что большая часть этой анатомии разделяется с DatePicker, поэтому вы можете повторно использовать многие компоненты между ними, если у вас есть оба.
 *
 * ## Дополнительная информация
 *
 * Прочитайте нашу статью в [блоге](https://react-spectrum.adobe.com/blog/date-and-time-pickers-for-all.html), чтобы узнать больше о
 * возможностях интернационализации, доступности и пользовательского опыта,
 * реализованных в DateField.
 *
 *
 *
 * [Ссылка на документацию DateRangePicker](https://react-spectrum.adobe.com/react-aria/DateRangePicker.html#daterangepicker)
 */
const meta: Meta<typeof DateRangePicker> = {
  component: DateRangePicker,
  title: 'Date & Time/DateRangePicker',
  args: {
    visibleMonthDuration: 2,
    label: 'Created',
    startAriaLabel: 'Start date',
    endAriaLabel: 'End date',
  },
  parameters: {
    layout: 'centered',
  },
  tags: ['autodocs'],
};

export default meta;

type Story = StoryObj<typeof DateRangePicker>;

export const Default: Story = {
  args: {},
};
