import type { ReactElement } from 'react';
import type { TableProps } from 'react-aria-components';
import { Table as AriaTable } from 'react-aria-components';

import { tableRecipe } from '#styled-system/recipes';

/**
 * Table — это компонент, который отображает данные в строках и столбцах, позволяя пользователю навигировать по содержимому с помощью клавиш навигации и поддерживать выбор строк и сортировку.
 * Table помогает создать доступные и интерактивные таблицы, которые можно стилизовать по мере необходимости.
 *
 * ## Анатомия
 *
 * **Контейнер**: Основной элемент, содержащий таблицу.
 *
 * **Строки**: Набор строк, каждая из которых состоит из ячеек с данными.
 *
 * **Столбцы**: Поддерживают заголовки и могут быть настроены для сортировки и изменения размера.
 *
 * **Ячейки**: Могут содержать интерактивные элементы, такие как кнопки и меню.
 *
 * Если таблица поддерживает выбор строк, каждая строка может включать флажок выбора. При поддержке множественного выбора также может отображаться флажок "Выбрать все" в заголовке столбца.
 * Если таблица поддерживает изменение размера столбцов, она должна быть обернута в <ResizableTableContainer>, и в каждом изменяемом столбце должен быть включен <ColumnResizer>.
 *
 * ## Особенности
 *
 * **Выбор строк**: Поддержка единственного или множественного выбора с флажками, отключенными строками и поведением замены или переключения выбора.
 *
 * **Интерактивные ячейки**: Ячейки таблицы могут включать интерактивные элементы, такие как кнопки и меню.
 *
 * **Действия**: Поддержка навигации по строкам и ячейкам через клик, касание, двойной клик или клавишу Enter.
 *
 * **Асинхронная загрузка**: Поддержка загрузки и сортировки элементов асинхронно.
 *
 * **Навигация с клавиатуры**: Строки, ячейки и фокусируемые элементы можно навигировать с помощью стрелок и других клавиш.
 *
 * **Перетаскивание**: Поддержка перетаскивания для изменения порядка строк.
 *
 * **Доступность**: Соответствует ARIA-структуре сетки с дополнительными объявлениями о выборе через ARIA живой регион.
 *
 * Table идеально подходит для отображения сложных наборов данных с возможностью интерактивного взаимодействия.
 *
 * [Ссылка на документацию](https://react-spectrum.adobe.com/react-aria/Table.html#table)
 */

export function Table(props: TableProps): ReactElement {
  const classNames = tableRecipe();
  return <AriaTable {...props} className={classNames.root} />;
}
