import type { Meta, StoryObj } from '@storybook/react-vite';

import { Calendar } from './Calendar';

/**
 * Calendar — это компонент, который отображает одну или несколько
 * сеток дат и позволяет пользователям выбирать одну дату.
 *
 * ## Особенности
 * - **Гибкость**: Поддерживает отображение одного или нескольких
 *   месяцев, а также настраиваемые временные диапазоны, например,
 *   недельный вид. Также поддерживаются минимальные и максимальные
 *   значения, недоступные даты и выбор непоследовательных дат.
 * - **Международная поддержка**: Поддерживает 13 календарных
 *   систем, включая григорианский, буддийский, исламский, персидский
 *   и другие. Доступно форматирование с учетом локали, системы
 *   чисел и поддержка справа налево.
 * - **Доступность**: Ячейки календаря можно навигировать и
 *   выбирать с помощью клавиатуры. Локализованные сообщения для
 *   экранных считывателей включены для уведомления об изменениях
 *   выбора и видимого диапазона дат.
 * - **Настраиваемый**: Как и все компоненты React Aria, структура
 *   DOM и стили всех элементов полностью настраиваемы.
 *
 *   ## Анатомия
 *
 * Календарь состоит из элемента группировки, содержащего одну или
 * несколько сеток дат (например, месяцев), а также кнопок "предыдущий"
 * и "следующий" для навигации между диапазонами дат. Каждая сетка
 * календаря включает ячейки, содержащие элементы кнопок, которые
 * можно нажимать и к которым можно переходить с помощью клавиш
 * стрелок для выбора даты.
 *
 * Календарь также поддерживает опциональный элемент сообщения об
 * ошибке, который можно использовать для предоставления дополнительного
 * контекста по любым ошибкам валидации. Это сообщение связано с
 * календарем через атрибут aria-describedby.
 *
 * ## Дополнительная информация
 *
 * Прочитайте нашу статью в [блоге](https://react-spectrum.adobe.com/blog/date-and-time-pickers-for-all.html), чтобы узнать больше о возможностях интернационализации, доступности и пользовательского опыта, реализованных в DateField.
 * [Подробнее о Calendar](https://react-spectrum.adobe.com/react-aria/Calendar.html#calendar)
 */

const meta: Meta<typeof Calendar> = {
  component: Calendar,
  title: 'Date & Time/Calendar',
  args: {},
  parameters: {
    layout: 'centered',
  },
  tags: ['autodocs'],
};

export default meta;

type Story = StoryObj<typeof Calendar>;

export const Default: Story = {
  args: {},
};
